In [1]:
# Import modules
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt
import plotly.graph_objs as go 
from plotly.offline import init_notebook_mode,iplot


import warnings
warnings.filterwarnings("ignore", category=FutureWarning)
init_notebook_mode(connected=True)

In [2]:
# Load data
df = pd.read_csv('data/house_data.csv')

In [3]:
# reading the data
df.info()
df.shape
df.tail()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 85509 entries, 0 to 85508
Data columns (total 8 columns):
Price          85509 non-null object
Address        85509 non-null object
Bedrooms       64999 non-null object
Bathrooms      69439 non-null object
Size           73698 non-null object
Sale Status    69960 non-null object
URL            85509 non-null object
Raw Price      85509 non-null float64
dtypes: float64(1), object(7)
memory usage: 5.2+ MB

,Price,Address,Bedrooms,Bathrooms,Size,Sale Status,URL,Raw Price
85504,"$79,000,000","2 Park Pl, New York, NY 10007",NaN,1 ba,"9,680 sqft",Condo for sale,https://www.zillow.com/homedetails/2-Park-Pl-N...,79000000.0
85505,"$90,000,000","432 Park Ave #82, New York, NY 10022",6 bds,8 ba,"8,054 sqft",Condo for sale,https://www.zillow.com/homedetails/432-Park-Av...,90000000.0
85506,"$95,000,000","1441 Angelo Dr, Los Angeles, CA 90210",NaN,NaN,NaN,Lot / Land for sale,https://www.zillow.com/homedetails/1441-Angelo...,95000000.0
85507,"$99,000,000","908 Bel Air Rd, Los Angeles, CA 90077",9 bds,20 ba,"34,000 sqft",House for sale,https://www.zillow.com/homedetails/908-Bel-Air...,99000000.0
85508,"$110,000,000","30 Beverly Park Ter, Beverly Hills, CA 90210",8 bds,12 ba,-- sqft,House for sale,https://www.zillow.com/homedetails/30-Beverly-...,110000000.0

In [4]:
# drop NaN, Price, URL, and assign to df1
def metric_deletion(x):
    x.dropna(axis='rows',inplace=True)
    x = x[x.Bedrooms != '-- bds']
    x = x[x.Bathrooms != '-- ba']
    x = x[x.Size != '-- sqft']
    x.drop(['URL', 'Price'], axis=1,inplace=True)
    return x
df1 = metric_deletion(df)
df1.head()

,Address,Bedrooms,Bathrooms,Size,Sale Status,Raw Price
5,"3515 W Thompson Rd, Indianapolis, IN 46217",2 bds,1 ba,814 sqft,House for sale,1.0
53,"3713 Hillside Ave, Indianapolis, IN 46218",2 bds,1 ba,"1,728 sqft",House for sale,775.0
65,"1337 W Livingston St APT 1, Allentown, PA 18102",3 bds,1 ba,"1,000 sqft",House for sale,1050.0
70,"1788 Westwood Dr, Troy, MI 48083",3 bds,2 ba,"1,418 sqft",House for sale,1600.0
72,"390 Rosado Springs St, Henderson, NV 89014",2 bds,2 ba,"1,060 sqft",Townhouse for sale,1700.0

In [5]:
# Converting Bathrooms into float
df1.Bathrooms = df1.Bathrooms.str.replace(' ba','').astype('float')
# Converting Bedrooms into float
df1.Bedrooms = df1.Bedrooms.str.replace(' bds','').astype('float')

In [6]:
# Converting Size to float
def filt_size(s):
    s= s.replace(',','')
    s =s.replace(' sqft','')
    return float(s)
df1.Size = df1.Size.apply(filt_size)

In [7]:
# Spliting Address into Street, City, State, ZipCode, and drop the Address
df1.Address = df1.Address.astype('str')
df1['Street']= df1.Address.apply(lambda x: x.split(', ')[0])
df1['City']= df1.Address.apply(lambda x: x.split(', ')[1])
df1['State']= df1.Address.apply(lambda x: (x.split(', ')[-1]).split(' ')[0])
df1['ZipCode']= df1.Address.apply(lambda x: (x.split(', ')[-1]).split(' ')[1])
df2 = df1.drop(['Address'],axis=1)

In [8]:
#reset the index
df2.reset_index(inplace=True,drop=True)

In [9]:
# Found two rows of abnormal values, so found exact address on google and replace with the right values
df2.loc[28709:28711, 'State']= 'AZ'
df2.loc[28709:28711, 'ZipCode']= '85260'

In [25]:
# Converting the columns as strings for further cleaning
df2[['Street','City','State','ZipCode']].astype('str')

                               Street              City State ZipCode
0                  3515 W Thompson Rd      Indianapolis    IN   46217
1                   3713 Hillside Ave      Indianapolis    IN   46218
2          1337 W Livingston St APT 1         Allentown    PA   18102
3                    1788 Westwood Dr              Troy    MI   48083
4               390 Rosado Springs St         Henderson    NV   89014
5                    11209 Grenada Dr  Sterling Heights    MI   48312
6            65710 Adventure Ct #305A              Bend    OR   97701
7                     3970 Garland St           Detroit    MI   48214
8                     2127 Merrick St           Detroit    MI   48208
9                    14383 Hubbell St           Detroit    MI   48227
10                   3301 Columbus St           Detroit    MI   48206
11                 6834 Charlevoix St           Detroit    MI   48207
12                   14415 Hubbell St           Detroit    MI   48227
13                   3226 Columbus St           Detroit    MI   48206
14                   3236 Columbus St           Detroit    MI   48206
15                   14238 Hubbell St           Detroit    MI   48227
16                    14578 Lappin St           Detroit    MI   48205
17           65690 Adventure Ct #108L              Bend    OR   97701
18             23023 Nicklaus Dr #405              Bend    OR   97701
19            65690 Adventure Ct #105              Bend    OR   97701
20            65690 Adventure Ct #104              Bend    OR   97701
21            65710 Adventure Ct #304              Bend    OR   97701
22                3924 Lillibridge St           Detroit    MI   48214
23             23023 Nicklaus Dr #401              Bend    OR   97701
24                    1818 Trinity Dr            Toledo    OH   43606
25                   1030 Indiana Ave            Toledo    OH   43607
26                 109 Mcallister Ave          Syracuse    NY   13205
27                    112-14 Hatch St          Syracuse    NY   13205
28                   244 Garfield Ave          Syracuse    NY   13205
29                      1614 SW C Ave            Lawton    OK   73501
...                               ...               ...   ...     ...
45369              111 Murray St #PH2          New York    NY   10007
45370        555 W End Ave #PENTHOUSE          New York    NY   10024
45371           293 Lafayette St #PH1          New York    NY   10012
45372      157 W 57th St PENTHOUSE 87          New York    NY   10019
45373               1932 N Burling St           Chicago    IL   60614
45374              1 Franklin St #GPH            Boston    MA   02110
45375                  10350 Wyton Dr       Los Angeles    CA   90024
45376             277 Saint Pierre Rd       Los Angeles    CA   90077
45377             1426 Summitridge Dr     Beverly Hills    CA   90210
45378  15 Central Park W PENTHOUSE 41          New York    NY   10023
45379                 2 Oak Knoll Ter          Pasadena    CA   91106
45380                   11490 Orum Rd       Los Angeles    CA   90049
45381              220 Central Park S          New York    NY   10019
45382                     995 5th Ave          New York    NY   10028
45383                    1125 5th Ave          New York    NY   10128
45384                    70 W 45th St          New York    NY   10036
45385               545 S Mapleton Dr       Los Angeles    CA   90024
45386             1301 Collingwood Pl       Los Angeles    CA   90069
45387                     8 E 62nd St          New York    NY   10065
45388         15 Central Park W #PH43          New York    NY   10023
45389             1251 Tower Grove Dr     Beverly Hills    CA   90210
45390               10701 Bellagio Rd       Los Angeles    CA   90077
45391             1201 Tower Grove Dr     Beverly Hills    CA   90210
45392                    12 E 63rd St          New York    NY   10065
45393               133 S Mapleton Dr       Los Angeles    CA   90024
45394      111 W 57th St PENTHOUSE 72          New York    NY   10019
45395                  0 Del Valle Rd         Livermore    CA   94550
45396               1060 Brooklawn Dr       Los Angeles    CA   90077
45397                432 Park Ave #82          New York    NY   10022
45398                  908 Bel Air Rd       Los Angeles    CA   90077

[45399 rows x 4 columns]

In [26]:
# Finding the weird ZipCode, it is in Canada
df2.loc[df2.ZipCode == 'N9V']

,Bedrooms,Bathrooms,Size,Sale Status,Raw Price,Street,City,State,ZipCode
38379,4.0,4.0,2800.0,House for sale,865000.0,349 Benson Ct,Amherstburg,ON,N9V

In [27]:
# Dropping the row
df2.drop(df2.iloc[38379].name,inplace=True)

In [28]:
# Now the ZipCode can be converted to Integer
df2.ZipCode = df2.ZipCode.astype('int')

In [29]:
#convert Sale Status into house Types
house_status = list(df2['Sale Status'].unique())
house_type = ['House','Townhouse','Multifamily', 'Condo', 'Others', 'Apartment']
df2['Sale Status'] = df2['Sale Status'].map(dict(zip(house_status,house_type)))
df2.rename(columns={"Sale Status": "Type"}, inplace=True)

In [30]:
# Street Column might not be useful
df3 = df2.drop(['Street'], axis=1)

In [31]:
# Change Raw Price column name to Price, create perSqft column
df3.rename(columns={"Raw Price":"Price"}, inplace=True)
df3['perSqFt'] = df3.Price / df3.Size

In [32]:
# Due to previously dropping rows, reset index again
df3 = df3.reset_index(drop=True)

In [33]:
# Assign Regions
west = ['CA', 'NV', 'AK', 'WA' , 'OR', 'ID', 'MT', 'WY', 'UT', 'CO', 'AZ', 'NM', 'HI']
midwest = ['ND', 'WI','SD', 'NE', 'KS', 'MN', 'IA', 'MO', 'WI', 'IL', 'IN', 'OH','MI']
north = ['PA', 'NY', 'NH', 'MA', 'CT', 'ME', 'DC', 'NJ', 'RI']
south = ['TX', 'OK', 'AR', 'LA', 'MS', 'AL', 'TN', 'KY', 'WV', 'VA', 'MD', 'DE', 'NC', 'SC', 'GA', 'FL']
full_state_list = west + midwest + north + south

# Creating function to assign regions
def find_region(state):
    if state in west:
        state = 'West'
    elif state in north:
        state = 'North'
    elif state in south:
        state = 'South'
    elif state in midwest:
        state = 'MidWest'
    return state

# Create Region column
df3['Region'] = df3.State.apply(find_region)

In [35]:
df3.head()

,Bedrooms,Bathrooms,Size,Type,Price,City,State,ZipCode,perSqFt,Region
0,2.0,1.0,814.0,House,1.0,Indianapolis,IN,46217,0.001229,MidWest
1,2.0,1.0,1728.0,House,775.0,Indianapolis,IN,46218,0.448495,MidWest
2,3.0,1.0,1000.0,House,1050.0,Allentown,PA,18102,1.050000,North
3,3.0,2.0,1418.0,House,1600.0,Troy,MI,48083,1.128350,MidWest
4,2.0,2.0,1060.0,Townhouse,1700.0,Henderson,NV,89014,1.603774,West

In [37]:
#created a function that finds states with not enough data to produce analysis
def little_data_states(tab):
    little_info_state = []
    for x in full_state_list:
        if len(tab[tab['State'] == x]) < 30:
            little_info_state.append(x)
    return little_info_state

states_exempted= little_data_states(df3)

In [39]:
#created a new dataframe that would filter out these states from the df3 dataframe
df4 = df3[~df3['State'].isin(states_exempted)]
df4.head()

,Bedrooms,Bathrooms,Size,Type,Price,City,State,ZipCode,perSqFt,Region
0,2.0,1.0,814.0,House,1.0,Indianapolis,IN,46217,0.001229,MidWest
1,2.0,1.0,1728.0,House,775.0,Indianapolis,IN,46218,0.448495,MidWest
2,3.0,1.0,1000.0,House,1050.0,Allentown,PA,18102,1.050000,North
3,3.0,2.0,1418.0,House,1600.0,Troy,MI,48083,1.128350,MidWest
4,2.0,2.0,1060.0,Townhouse,1700.0,Henderson,NV,89014,1.603774,West

In [40]:
pd.set_option('display.float_format', '{:.2f}'.format)
pd.pivot_table(df4, values=['perSqFt'], index=['State'])

       perSqFt
State
AK      175.69
AL      136.81
AR      142.48
AZ      578.91
CA      498.29
CO      336.63
CT      212.42
DC      574.93
DE      147.46
FL      231.73
GA      154.64
IA       97.06
ID      269.87
IL      178.29
IN      112.11
KS      122.80
KY      197.18
LA      146.52
MA      610.23
MD      168.14
ME      477.70
MI      102.92
MN      226.40
MO      136.04
MS      101.42
MT      202.14
NC      248.81
ND      121.78
NE      152.47
NJ     1474.06
NM      165.55
NV      240.31
NY      528.16
OH      105.99
OK      149.21
OR      285.81
PA      199.40
RI      207.28
SC      213.95
SD      166.50
TN      247.32
TX      146.90
UT      214.55
VA      332.91
WA      279.37
WI      180.49

In [ ]:
'''
NOT WORKING CORRECTLY


data = dict(type = 'choropleth',colorscale='Portland',locations=df3['State'],locationmode='USA-states', z=df3['Price'],text=df3['Price'], colorbar={'title':'perSqFt'})
choromap = go.Figure(data = [data],layout = dict(geo = {'scope':'usa'}))

iplot(choromap,validate=False)
'''

In [ ]:
# for GeoPandas later use
# df2 = df2[df2['ZipCode'].between(10000,99999,inclusive='both')]